[{"0": "Short for e lectronic mail, the transmission of messages over communications networks. The messages can be notes entered from the keyboard or electronic files stored on disk. Most mainframes, minicomputers, and computer networks have an e-mail system. Some electronic-mail systems are confined to a single computer system or network, but others have gateways to other computer systems, enabling users to send electronic mail anywhere in the world. Companies that are fully computerized make extensive use of e-mail because it is fast, flexible, and reliable. Most e-mail systems include a rudimentary text editor for composing messages, but many allow you to edit your messages using any editor you want. You then send the message to the recipient by specifying the recipient's address. You can also send the same message to several users at once. This is called broadcasting. Sent messages are stored in electronic mailboxes until the recipient fetches them. To see if you have any mail, you may have to check your electronic mailbox periodically, although many systems alert you when mail is received. After reading your mail, you can store it in a text file, forward it to other users, or delete it. Copies of memos can be printed out on a printer if you want a paper copy. All online services and Internet Service Providers (ISPs) offer e-mail, and most also support gateways so that you can exchange mail with users of other systems. Usually, it takes only a few seconds or minutes for mail to arrive at its destination. This is a particularly effective way to communicate with a group because you can broadcast a message or document to everyone in the group at once. Although different e-mail systems use different formats, there are some emerging standards that are making it possible for users on all systems to exchange messages. In the PC world, an important e-mail standard is MAPI. The CCITT standards organization has developed the X.400 standard, which attempts to provide a universal way of addressing messages. To date, though, the de facto addressing standard is the one used by the Internet system because almost all e-mail systems have an Internet gateway. Another common spelling for e-mail is email. Also see Why E-Mails Bounce and Getting Rid of Spam in the Did You Know section of Webopedia. Often times technologies start as hype but with time become adopted. As a developer or technologist, it is worth reading the hype and knowing the... The top 5 Hyper-V questions with answers provided by Nirmal Sharma, a MCSEx3, MCITP and Microsoft MVP in Directory Services. Solid state drives and software defined storage are two leading trends in the rapidly growing storage market. Creating desktop shortcuts to a websites is useful. When you double-click the icon from your desktop it automatically launches the browser and... Although it is almost impossible to keep up with the pace of ongoing product releases, here are three recent highlights in the flash data storage... ", "1": " :a means or system for transmitting messages electronically (as between computers on a network) communicating by :messages sent and received electronically through an e-mail system receives a lot of :an e-mail message sent him an : spam ", "2": "", "3": "Electronic mail, most commonly referred to as email or e-mail since ca. 1993, is a method of exchanging digital messages from an author to one or more recipients. Modern email operates across the Internet or other computer networks. Some early email systems required that the author and the recipient both be online at the same time, in common with instant messaging. Today's email systems are based on a store-and-forward model.", "word": "email", "5": "It's hard to remember what our lives were like without e-mail.  Ranking up there with the Web as one of the most useful features of the Internet, e-mail has become one of today's standard means of communication.  Billions of messages are sent each year.  If you're like most people these days, you probably have more than one e-mail address.  After all, the more addresses you have, the more sophisticated you look... E-mail is part of the standard TCP/IP set of protocols.  Sending messages is typically done by SMTP (Simple Mail Transfer Protocol) and receiving messages is handled by POP3 (Post Office Protocol 3), or IMAP (Internet Message Access Protocol).  IMAP is the newer protocol, allowing you to view and sort messages on the mail server, without downloading them to your hard drive. Though e-mail was originally developed for sending simple text messages, it has become more robust in the last few years.  Now, HTML-based e-mail can use the same code as Web pages to incorporate formatted text, colors, and images into the message.  Also, documents can be attached to e-mail messages, allowing files to be transfered via the e-mail protocol.  However, since e-mail was not originally designed to handle large file transfers, transferring large documents (over 3 MB, for example) is not allowed by most mail servers.  So remember to keep your attachments small! ", "4": "(computer science) a system of world-wide electronic communication in which a computer user can compose a message at one terminal that can be regenerated at the recipient's terminal when the recipient logs in"}, {"0": "A computer generally means a programmable machine. The two principal characteristics of a computer are: it responds to a specific set of instructions in a well-defined manner and it can execute a prerecorded list of instructions (a program ). Modern computers are electronic and digital. The actual machinery wires, transistors, and circuits is called hardware ; the instructions and data are called software. All general-purpose computers require the following hardware components: In addition to these components, many others make it possible for the basic components to work together efficiently. For example, every computer requires a bus that transmits data from one part of the computer to another. Computers can be generally classified by size and power as follows, though there is considerable overlap: 1. What is computer history? 2. What is computer hardware? 3. What is computer software? 4. What is computer science? 5.What is computer interface? Often times technologies start as hype but with time become adopted. As a developer or technologist, it is worth reading the hype and knowing the... The top 5 Hyper-V questions with answers provided by Nirmal Sharma, a MCSEx3, MCITP and Microsoft MVP in Directory Services. Solid state drives and software defined storage are two leading trends in the rapidly growing storage market. Creating desktop shortcuts to a websites is useful. When you double-click the icon from your desktop it automatically launches the browser and... Although it is almost impossible to keep up with the pace of ongoing product releases, here are three recent highlights in the flash data storage... ", "1": " :one that computes :a programmable usually electronic device that can store, retrieve, and process data :a branch of science that deals with the theory of computation or the design of computers :a computer that operates with numbers represented by directly measurable quantities (as voltages or rotations) compare digital computer hybrid computer :a computer that operates with numbers expressed directly as digits compare analog computer hybrid computer :a personal computer used in the home :a computer system consisting of a combination of analog and digital computer systems :a general-purpose computer equipped with a microprocessor and designed to run especially commercial software (as a word processor or Internet browser) for an individual user ", "2": "A person who makes calculations or computations; a calculator, a reckoner; spec. a person employed to make calculations in an observatory, in surveying, etc. Now chiefly hist.", "3": "A computer is a general purpose device that can be programmed to carry out a set of arithmetic or logical operations automatically. Since a sequence of operations can be readily changed, the computer can solve more than one kind of problem.\nConventionally, a computer consists of at least one processing element, typically a central processing unit (CPU), and some form of memory. The processing element carries out arithmetic and logic operations, and a sequencing and control unit can change the order of operations in response to stored information. Peripheral devices allow information to be retrieved from an external source, and the result of operations saved and retrieved.", "word": "computer", "5": "Technically, a computer is a programmable machine.  This means it can execute a programmed list of instructions and respond to new instructions that it is given.  Today, however, the term is most often used to refer to the desktop and laptop computers that most people use.  When referring to a desktop model, the term \"computer\" technically only refers to the computer itself -- not the monitor, keyboard, and mouse.  Still, it is acceptable to refer to everything together as the computer.  If you want to be really technical, the box that holds the computer is called the \"system unit.\" Some of the major parts of a personal computer (or PC) include the motherboard, CPU, memory (or RAM), hard drive, and video card.  While personal computers are by far the most common type of computers today, there are several other types of computers.  For example, a \"minicomputer\" is a powerful computer that can support many users at once.  A \"mainframe\" is a large, high-powered computer that can perform billions of calculations from multiple sources at one time.  Finally, a \"supercomputer\" is a machine that can process billions of instructions a second and is used to calculate extremely complex calculations. ", "4": "a machine for performing calculations automatically"}]